sae/sae-webservices-test/src/test/resources/soap/request/consultation_success.xml

<soap:Envelope
   xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
   xmlns:sae="http://www.cirtil.fr/saeService">

   <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">

      <wsse:Security
         xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
         xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">

         <saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" ID="26737cc3-837d-4e79-8086-f1932c8d54ea" IssueInstant="2011-04-19T14:39:47.816Z" Version="2.0"><saml2:Issuer>PNR</saml2:Issuer><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#26737cc3-837d-4e79-8086-f1932c8d54ea"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>whumorx+jSzvgMhMTjetpzsmt5I=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>E5GwuAmizBxDRstw8aiAc+BJCr8MLMc7jGC5JNJyeJ5bbHRZboo/U6eYdK6rDmqIJ5mbRLhi08x1PkIV44bXAvgYCcf5YLg2r2tii8y53v1eVn2l0NkpwmFS67i4RIiyuigeRVUIIAHkfW8nI0a45Fj0qsfTaFzjyNQ7ernDeKRjivkb1Wywa+mM5B6kgjKSxqtJWhuXbCfAGdhTiyxp0fArNonDp+war7A5PBg55etpETw+u75ZmITWlEk3y3o04ptM98rtz6rKreZancEWpcqsP/3rvCBdLACETEvTrC+7RYrOrtlSNbvk+tJrtdGj8bUH5/aFA83+4IuSWBynlBzllG4Kf9XPTkSevrgnS5oILBrv1p/sNlfd49xqfyvo11QYCEuag8QabdWkaolZ18aqGPGUlzr/lORBmaXZXb9MmYGd8s+2eRS4Clgm8O4mcu1XUnVaVzT/XvUGAJ/3EXkF+RgKp5Fw69bDvdaaSUNsp89nI641mflGRrkRyHnFd3MCBfXFDSUWu51cAeOLdZZV2YjBYZT1VCWlHQtEkcBoG1oomdt9u2jx5k6ZsuzipEF1O95lBgJFyt7OWvVU2jMI+NcAtPGqmjsza+K2FqSYaFFgKchHy5L8+qrMwVh+j0FJou9JbFn0a5J6OeWfjYH6CUV1L0yEu85Nd+7NApw=</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIIE8DCCA9igAwIBAgIBKTANBgkqhkiG9w0BAQUFADBYMQswCQYDVQQGEwJGUjEPMA0GA1UECAwG
         RnJhbmNlMQ4wDAYDVQQHDAVQYXJpczEOMAwGA1UECgwFQUNPU1MxGDAWBgNVBAMMD0FDIEFwcGxp
         Y2F0aW9uczAeFw0xMTA0MTkwNjU1MzBaFw0yMDA0MTIxNTU5MjJaMHQxCzAJBgNVBAYTAkZSMQ8w
         DQYDVQQIDAZGcmFuY2UxDjAMBgNVBAcMBVBhcmlzMQ4wDAYDVQQKDAVBQ09TUzEVMBMGA1UECwwM
         QXBwbGljYXRpb25zMR0wGwYDVQQDDBRQTlJfQXBwbGljYXRpb25fVGVzdDCCAiIwDQYJKoZIhvcN
         AQEBBQADggIPADCCAgoCggIBAJ9gcmD+y0AatV7l3DmU/IZOJBuCu8IjkIli0zKs2pR2c7rUoH2J
         8d1893mM7AnqENqCsL+G2Vix/QXbBQHVgv32AevxODPNcUeYmC3bvgt2ldH5nbydJBJkc05U9oCF
         FQp8yvTFNDE5keYgvA/fiTF7UlApvRWPFZRzcm3/rLRuJEtTxf8nwBFWsEmen2NYRhQEXuvPBHEi
         2AwN1FS4QkxPXjwuBMQv6y+xZqERuilthAUmmTusNDsbOHmIYOyHdfUrNV2Hns9ruY1WL9F3JtFB
         5Qu0P48ylTkJzrmdq5dU4viVvBOIfHyDqj6R0AvvxKH2N4IzIqkYGnUmK0Zr735T4p/7BTA9HRLe
         KI/rLieX5bKdsIKeFtGQvpWL3r09yZOlGTNzdxJDsrO9jHRLoclxSheYUZMvl883LMqz42YwJThm
         j1uXY60kJPl+QK0EAM9tdt1mzJBtPRVN3l5Mp0S4080g5oILNdmS22XL0iTUtM8ZPOY+Ab2GC8cT
         cLnM2ipJzDu9Ts+PHzHuRv2TRYF68Sfm0+55Nlo5oha/fwbhsGhGb2PB8RDHNm2UuuYveNfwaQI7
         DmZaeeNpBTqo2RG4w5+PzjcRc/plE326PlkSYziiUITntHOnWBTRqECQd/B95UxOFfCVih3f/XiN
         hUNr5St0JS5MIo6u/zc36bltAgMBAAGjgagwgaUwHQYDVR0OBBYEFCngy00HHzzdoVfabB9Pi/Wt
         qc8NMB8GA1UdIwQYMBaAFPT3B/9/Ods1pgJrcwz0Qo5iy5nMMBEGCWCGSAGG+EIBAQQEAwIGwDAd
         BgNVHSUEFjAUBggrBgEFBQcDAgYIKwYBBQUHAwEwCwYDVR0PBAQDAgWgMCQGA1UdEQQdMBuBGW1h
         cmVjaGUucGF1bEBjZXI2OS5yZWNvdXYwDQYJKoZIhvcNAQEFBQADggEBAHV1ksHT4E8kQxOFZukR
         rEwoMWnl+pTOYiBUuoTnb2OE+I9ITlQY6k7+kbNWiQ6XEJMrHUIrhmCUaHUkOHE+lMgxCtybm/jJ
         W76Mr145o1QfGvBrlyfStVVOCJrjD6bN1eZG/xDH6p4NUWI35QatdTdRtEob3+mp5omqAh1NoOMF
         gWdrMsbvhkmz0AxupL9jyrb1gCcdy3BP7HItHfRG0a9BLrXiEHthnnoqzLuYcB/RCy+UpJStsxVx
         c/4fi7BHRfTdUFcS0WQ5Or8LiEJkcZatqovE52zJbR/qxwyBZh5jfr8ySSZIJmQB4JtXZbJwjrri
         +nQTkm1D6h5e9uXVEgo=</ds:X509Certificate><ds:X509Certificate>MIID+DCCAuCgAwIBAgIBATANBgkqhkiG9w0BAQUFADBfMQswCQYDVQQGEwJGUjEPMA0GA1UECAwG
         RnJhbmNlMQ4wDAYDVQQHDAVQYXJpczEOMAwGA1UECgwFQUNPU1MxHzAdBgNVBAMMFkFDIFJlY291
         dnJlbWVudCBSYWNpbmUwHhcNMTAwNDE1MTYwMzEwWhcNMjAwNDEyMTU1OTIyWjBYMQswCQYDVQQG
         EwJGUjEPMA0GA1UECAwGRnJhbmNlMQ4wDAYDVQQHDAVQYXJpczEOMAwGA1UECgwFQUNPU1MxGDAW
         BgNVBAMMD0FDIEFwcGxpY2F0aW9uczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAMjf
         q+OYpckuhO10ixz5WjeuPm8lI9fFEPivCOoa1DawJHoHa/XUIuNxZm1j6vKAEE5w6hbAvV6ztwpI
         bgnTlnbJWfZoUM7ohwPGl1B3x2nRyNC1Dl4j9/Fda73bPrPZpWLC8HugYb34PxALfeirgEeR6Y7G
         E5HzSXlmB4bNTYXiSPXtaTuYWcXBO4cUsj6cDv9aWE0wf4NN+tctVtT9qlGlAaLW4M0hKdpzkpqG
         JlpNY7RnC0BNojece0OgmdRIe0AwSXu0/hNKG5jnnguwzrFTSwl/zmp7ZYERSIn/sMkZodQfzWw5
         u0N36gZsBzLFQPyQTpWf0QsyuU1KYN1D6jUCAwEAAaOBxTCBwjAPBgNVHRMBAf8EBTADAQH/MB0G
         A1UdDgQWBBT09wf/fznbNaYCa3MM9EKOYsuZzDAfBgNVHSMEGDAWgBQaGScPA/kpHjPFNAV/c2yL
         fhH7szAYBgNVHSAEETAPMA0GCysGAQQB/3iHaAEBMA4GA1UdDwEB/wQEAwIBBjBFBgNVHR8EPjA8
         MDqgOKA2hjRodHRwOi8vY2VyNjlpZHhwa2l2YWwxLmNlcjY5LnJlY291di9Qc2V1ZG9fQXBwbGku
         Y3JsMA0GCSqGSIb3DQEBBQUAA4IBAQA/xpYbpXyA6ppTE0uAKVpoVyoXpYV+1hmGPzrE1XHd+4C0
         rLXHO1Q9Oyz1+NefcOoNX58cdJKTc38H0WxqyM1elFRrakIw+PVfX63PkrAkYZSnI9DKj39/8DJU
         QPLJu6owxyVD+WrpTz377U1v+GF36kIqMFgpI9Y61stbsoOJfKiTs1tSvuH2IILFh7zW1vGmdHFy
         9QaTmgIcsbKpUR40iwiXNfjcCPucms6JQICLZT0T0aeiGf82lHL7/+6AnXXTPwjNAS74RjQJyYTs
         J/anA7GfERXWTgM1OSr16HNUvQTntqsvRNC96XTk1+EYA40UrSsLSJamKBphPYQeAcRX</ds:X509Certificate><ds:X509Certificate>MIIEADCCAuigAwIBAgIBATANBgkqhkiG9w0BAQUFADBgMQswCQYDVQQGEwJGUjEPMA0GA1UECAwG
         RnJhbmNlMQ4wDAYDVQQHDAVQYXJpczEQMA4GA1UECgwHUE0vU0dETjEOMAwGA1UECwwFRENTU0kx
         DjAMBgNVBAMMBUlHQy9BMB4XDTEwMDQxNTE1NTkyMloXDTIwMDQxMjE1NTkyMlowXzELMAkGA1UE
         BhMCRlIxDzANBgNVBAgMBkZyYW5jZTEOMAwGA1UEBwwFUGFyaXMxDjAMBgNVBAoMBUFDT1NTMR8w
         HQYDVQQDDBZBQyBSZWNvdXZyZW1lbnQgUmFjaW5lMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIB
         CgKCAQEAltWThsQoDJf5B3KgConIWKR1c+4mm2eNpPGHIesE8CUmYhI5X7wa6Ezlx5eCJriVRhLL
         024BCDu0R2g2HV4wMEcMADb8vZ7/uVsKhot9r0Sp/ASlRzg7EdquN5QprfGrbXN5l0TdqtvoTFAU
         vPgKqRHnuYj6D6HKaWpNM6K653DN2ie5hGa/NzyZxkGhCU9cyt9Y+pOyY3Vs3pSxIjQ/XfDsiIjJ
         JNonnq1OBsK8GPQlxlVm6QY16wbZ2TuvSXCxn3elQF6qiHB9p1VtUylUobFY4jXO/a6DfR699FVZ
         kB+go6U0mzrnHe6jckdr1LSABII9+8OkjUhJduvt4Moa9wIDAQABo4HFMIHCMA8GA1UdEwEB/wQF
         MAMBAf8wHQYDVR0OBBYEFBoZJw8D+SkeM8U0BX9zbIt+EfuzMB8GA1UdIwQYMBaAFA/V51UsBjLM
         m8gq6U3DaNB59qnJMBgGA1UdIAQRMA8wDQYLKwYBBAH/eIdoAQEwDgYDVR0PAQH/BAQDAgEGMEUG
         A1UdHwQ+MDwwOqA4oDaGNGh0dHA6Ly9jZXI2OWlkeHBraXZhbDEuY2VyNjkucmVjb3V2L1BzZXVk
         b19BQ09TUy5jcmwwDQYJKoZIhvcNAQEFBQADggEBAIl7Tu0FPoJguOFCVcQ5nKDBSSQWWwaoNMJS
         yM0hIAp1idGKBH6MU8rX28CL10eT/vawjXrWBXrDr4OBZaPwgBVcXoOEinB+PkAOmIPPYWG4WjC0
         XohqjsLt13aVzmjkaubxJuM5TBjwGv/IeSAh2bvsOgfZOxGwoGQm/baZRUjOrk6wfzOd/670FTC4
         JAp65cgfMKV/Y78MJonnb1SePYp3678/e3C/s9TrRtg500gXprmk6RyLbhqhVF7WZo0i5Vgf8fAl
         rtUUOFXg5prBg106GgKjor4sDW4XxTXQ2QAjQzLuG9G9I+hPIbHvpnIULz+SfHnt+c4iFeCQec3S
         xoU=</ds:X509Certificate><ds:X509Certificate>MIIDtTCCAp2gAwIBAgIBADANBgkqhkiG9w0BAQUFADBgMQswCQYDVQQGEwJGUjEPMA0GA1UECAwG
         RnJhbmNlMQ4wDAYDVQQHDAVQYXJpczEQMA4GA1UECgwHUE0vU0dETjEOMAwGA1UECwwFRENTU0kx
         DjAMBgNVBAMMBUlHQy9BMB4XDTEwMDQxNTE1NTA0N1oXDTIwMTAxNzE1NTA0N1owYDELMAkGA1UE
         BhMCRlIxDzANBgNVBAgMBkZyYW5jZTEOMAwGA1UEBwwFUGFyaXMxEDAOBgNVBAoMB1BNL1NHRE4x
         DjAMBgNVBAsMBURDU1NJMQ4wDAYDVQQDDAVJR0MvQTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCC
         AQoCggEBAOj/udIRj5ESUQ6Oxz4AxqMeFR7Cvesuk6DJYWNwBSBYcjYHzR+VnQPcbIgzIPrLCrN3
         HMTU/jqJs0UX+RFNc/uQh2QkIt5Z/wenTWFkogG3ml9toyQr4csiYnhDW9nZvLy5TTOK6ZgrPuz/
         L06i6glLBIFCc9p3jI9hUqp0vpOq6QWv8nVA5FDGHOVSxH68cfrwgoV80gtuDApWm0hFpE8jKqXU
         CYCKB1+mpE2qlG1GzRWvdCl3PTo60by8lCIppP2s+bGkwLsWR/RMXT7ck2FBuitvZpoYztk4N/fO
         n0EHBHIGVkCQ5+z/++lHKlj+jcGVLbn+o7VYzS2WGV8yAk0CAwEAAaN6MHgwDwYDVR0TAQH/BAUw
         AwEB/zAdBgNVHQ4EFgQUD9XnVSwGMsybyCrpTcNo0Hn2qckwHwYDVR0jBBgwFoAUD9XnVSwGMsyb
         yCrpTcNo0Hn2qckwFQYDVR0gBA4wDDAKBggqgXoBeQEBATAOBgNVHQ8BAf8EBAMCAQYwDQYJKoZI
         hvcNAQEFBQADggEBAGI38BlvnT2U8PaIFl9a7d/BIeAcZ/RWkbkIwWtg1pQmL2Mq9+PUK5tD07S8
         +s6Y1xyMqyaIJn1yyxfHAy6i1Aaa7OwbzoxpD8cb3K1TZHGlfAShxUItDBPPjQUwswwQ7FIVMMB4
         a89btbuIzMaRaICyuoRgtHPyVeRF3iyAPgfEFeOjJ0Jrf8yPDMAJg5K7pml7Q8/WlnQUreHbymFV
         Lrg/zQ2Q1JVQ4jsy2wHY81nBJWI+APK1A5da1Z2/hmzQiiz9BxqFgIqkV/oGIkfzit32xNuQrqYH
         br17DLXoWNZ+R0uwDmFPBsFihydnOviwR1KD1nYqUTuw97ZKNtaNP1w=</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature><saml2:Subject><saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified">NON_RENSEIGNE</saml2:NameID><saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"><saml2:SubjectConfirmationData NotOnOrAfter="2099-12-31T23:00:00.000Z" Recipient="urn:URSSAF"/></saml2:SubjectConfirmation></saml2:Subject><saml2:Conditions NotBefore="2011-02-28T23:00:00.000Z" NotOnOrAfter="2099-12-31T23:00:00.000Z"><saml2:AudienceRestriction><saml2:Audience>http://sae.urssaf.fr</saml2:Audience></saml2:AudienceRestriction></saml2:Conditions><saml2:AuthnStatement AuthnInstant="2011-04-19T14:39:47.816Z" SessionIndex="26737cc3-837d-4e79-8086-f1932c8d54ea"><saml2:AuthnContext><saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:unspecified</saml2:AuthnContextClassRef></saml2:AuthnContext></saml2:AuthnStatement><saml2:AttributeStatement><saml2:Attribute Name="PAGM"><saml2:AttributeValue>ROLE_TOUS;FULL</saml2:AttributeValue></saml2:Attribute></saml2:AttributeStatement></saml2:Assertion>
         
         <wsse:SecurityTokenReference wsu:Id="token1" wsse:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-tokenprofile-1.1#SAMLV2.0">
            <wsse:KeyIdentifier wsu:Id="token1" ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">
               26737cc3-837d-4e79-8086-f1932c8d54ea
            </wsse:KeyIdentifier>
         </wsse:SecurityTokenReference>

      </wsse:Security>

   </soap:Header>

   <soap:Body>
      <sae:consultation>
         <sae:idArchive>1261362f-c87c-4e48-a06a-bc6b69f514e4</sae:idArchive>
         <sae:urlConsultationDirecte>false</sae:urlConsultationDirecte>
      </sae:consultation>
   </soap:Body>
   
</soap:Envelope>