sae/sae-webservices/src/test/resources/request/archivageUnitaire_success1.xml

<?xml version='1.0' encoding='UTF-8'?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
 
   <Body>
      <ns1:archivageUnitaire xmlns:ns1="http://www.cirtil.fr/saeService">
         <ns1:objetNumerique>
            <!--You have a CHOICE of the next 2 items at this level-->
            <ns1:url>qsqsq</ns1:url>
            <ns1:contenu>cid:668931355768</ns1:contenu>
         </ns1:objetNumerique>
         <ns1:metadonnees>
            <!--Zero or more repetitions:-->
            <ns1:metadonnee>
               <ns1:code>qsqs</ns1:code>
               <ns1:valeur>qsqs</ns1:valeur>
            </ns1:metadonnee>
         </ns1:metadonnees>
      </ns1:archivageUnitaire>
   </Body>
   
</Envelope>
